Revit 2027 API
FabricSheet.IsNotBent Method
 Method to verify that a fabric sheet is flat.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsNotBent()
Public Function IsNotBent As Boolean
public:
bool IsNotBent()
member IsNotBent : unit -> bool
Return Value
Boolean
 True for flat fabric sheet, false for bent fabric sheet.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace